       IDENTIFICATION DIVISION.
       PROGRAM-ID. LOOPS.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-I        PIC 9(3) VALUE 1.
       01 WS-SUM      PIC 9(5) VALUE 0.

       PROCEDURE DIVISION.
           PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > 100
               COMPUTE WS-SUM = WS-SUM + WS-I
           END-PERFORM.

           DISPLAY 'THE SUM OF NUMBERS FROM 1 TO 100 IS: ' WS-SUM.
           STOP RUN.
