       01 SampleDataRow.
          02 SampleDataRow-id   PIC X(10) VALUE "3958345".
          02 SampleDataRow-name PIC X(20) VALUE "Jane Doe".
          02 SampleDataRow-age  PIC S9(2) VALUE 25.
          02 SampleDataRow-address PIC X(50) VALUE
                                       "123 Main St, Anytown, USA".
